index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-31 Tue 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syllabus (FIN 302) Financial Management Principles</title>
<meta name="author" content="Matthew Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Syllabus (FIN 302) Financial Management Principles</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org743a5a4">1. Description</a>
<ul>
<li><a href="#orgf380034">1.1. Overview</a></li>
<li><a href="#orgb80c30a">1.2. Course Learning Outcomes &amp; Objectives</a></li>
</ul>
</li>
<li><a href="#org9efe075">2. Exams</a></li>
<li><a href="#orgbce6831">3. Assignments</a></li>
<li><a href="#orgff267e6">4. Attendance/Quizzes/Participation</a></li>
<li><a href="#orgd8973af">5. Grading</a>
<ul>
<li><a href="#org55e56c0">5.1. An Important Note on Grading</a></li>
</ul>
</li>
<li><a href="#orgb4b4ce0">6. Tentative Outline by Week</a>
<ul>
<li><a href="#org1d04645">6.1. Exam Due Dates</a></li>
<li><a href="#org4cc4a4c">6.2. Assignment Due Dates</a></li>
</ul>
</li>
<li><a href="#orga0fa310">7. How To Ask Questions</a></li>
<li><a href="#org25fa0d3">8. Email Communication</a></li>
<li><a href="#org44f4b7b">9. Guidelines and Accommodations</a>
<ul>
<li><a href="#org3bd15dd">9.1. Course Syllabus Disclosure Statement Fall 2021</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
SUNY POLYTECHNIC INSTITUTE
</p>

<p>
SCHOOL OF BUSINESS ADMINISTRATION
</p>
</div>

<p>
<b><b>Instructor</b></b>: Matthew Brigida, Ph.D.
</p>

<p>
<b><b>Office</b></b>: Online Summer 2022 | On Campus Office is Donovan 1277
</p>

<p>
<b><b>Office Hours</b></b>: On-request I will create a BB Collaborate session where you can log in and ask questions.
</p>

<p>
<b><b>Email</b></b>:  matthew.brigida@sunypoly.edu
</p>

<p>
<b><b>Class Location</b></b>: Online (Asynchronous)
</p>

<p>
<b><b>Class Day/Time</b></b>: Asynchronous Online
</p>

<p>
<b><b>Text</b></b>: <a href="https://www.amazon.com/dp/0073382469/ref=olp_product_details?_encoding=UTF8&amp;me=">Essentials of Corporate Finance, 7th ed, ISBN: 978-0073382463</a> | <a href="https://www.amazon.com/gp/offer-listing/0073382469/ref=dp_olp_used?ie=UTF8&amp;condition=used">Used Copies usually starting from about $4</a> You also may use other editions of the text.
</p>

<p>
<b><b>Lecture Videos</b></b>: <a href="https://www.youtube.com/playlist?list=PLRK1VeglPb4MpA0hq3lhLn8olIz3NLai1">Introduction to Corporate Finance</a>
</p>

<p>
<b><b>Lecture Notes</b></b>: <a href="https://financial-education.github.io/intro_corp_fin.html">Financial Education</a>
</p>

<div id="outline-container-org743a5a4" class="outline-2">
<h2 id="org743a5a4"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
<b><b>Course Catalog Description</b></b>: General principles of corporate/managerial finance are presented. Topics include the tax environment, an overview of financial planning and control, working capital management, long term financing, time value of money, capital budgeting, cost of capital, dividend policy, agency theory, and international financial issues. Responsibilities and functions performed by financial analysts, financial managers, and chief financial managers are discussed. (Pre-requisite: ACC 201 or equivalent.)
</p>
</div>

<div id="outline-container-orgf380034" class="outline-3">
<h3 id="orgf380034"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>This course will present the fundamentals of managerial finance as a vital part of the complete business ecosystem. Importance is placed on becoming familiar with the rudimentary tools and techniques that act as the basis for all further study and function of finance.</li>

<li>Emphasis is also placed on exploring the human, technological, and environmental impacts on financial decision making and the societal variables that facilitate positive (financial and social) outcomes.</li>

<li>Attention to current events and linkage between financial markets and corporate decision-making and vis-a-vis is discussed.</li>

<li>Introduction to the role of the change agent and changing technology in financial analysis and financial decision-making processes.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb80c30a" class="outline-3">
<h3 id="orgb80c30a"><span class="section-number-3">1.2.</span> Course Learning Outcomes &amp; Objectives</h3>
<div class="outline-text-3" id="text-1-2">
<p>
CLO 1. Technical Competence: Adept in applying technology to solve institutional problems and enable effective financial decision making.
</p>

<p>
CLO 2. Analytical Problem Framing: Demonstrate individual capacity to evaluate and deploy analytical methods selected from a diverse portfolio of tools analyze and manage common financial decisions.
</p>

<p>
CLO 3. Strategic and Integrative Thinking: Understand the baseline resources available for analyzing and managing a firm’s financial performance. Including collecting data, processing information and evaluating and communicating outcomes with partners; differentiate between the accounting function as a preparer of data and information and the finance function as a user of information for decision making and the role of ethics in the process.
</p>

<p>
CLO 4. Leadership and Communication: Be capable of expressing key financial concepts and terms commonly used in the field; by using effective written, oral and interpersonal communications to contribute to the financial performance of domestic firms, global organizations and other international relationships.
</p>
</div>
</div>
</div>

<div id="outline-container-org9efe075" class="outline-2">
<h2 id="org9efe075"><span class="section-number-2">2.</span> Exams</h2>
<div class="outline-text-2" id="text-2">
<p>
There will be two exams.  The exams will be multiple choice. Failure to complete an exam by the due date will result in a grade of 0.
</p>
</div>
</div>

<div id="outline-container-orgbce6831" class="outline-2">
<h2 id="orgbce6831"><span class="section-number-2">3.</span> Assignments</h2>
<div class="outline-text-2" id="text-3">
<p>
There are 4 assignments under Content &gt; Assignments in BlackBoard.
</p>
</div>
</div>

<div id="outline-container-orgff267e6" class="outline-2">
<h2 id="orgff267e6"><span class="section-number-2">4.</span> Attendance/Quizzes/Participation</h2>
<div class="outline-text-2" id="text-4">
<p>
There is no attendance/participation grade.
</p>
</div>
</div>

<div id="outline-container-orgd8973af" class="outline-2">
<h2 id="orgd8973af"><span class="section-number-2">5.</span> Grading</h2>
<div class="outline-text-2" id="text-5">
<div class="org-center">
<p>

</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Item</th>
<th scope="col" class="org-right">Points</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Exam 1</td>
<td class="org-right">40</td>
</tr>

<tr>
<td class="org-left">Exam 2</td>
<td class="org-right">40</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Assignments</th>
<th scope="col" class="org-right">20</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Total Points</td>
<td class="org-right">100</td>
</tr>
</tbody>
</table>
</div>

<div class="org-center">
<p>
<b><b>Final grades will be assigned according to the following scale</b></b>:
</p>
</div>

<ul class="org-ul">
<li>90 - 100 A</li>
<li>80 - 89.9 B</li>
<li>70 - 79.9 C</li>
<li>60 - 69.9 D</li>
<li>\(<\) 60 F</li>
</ul>

<blockquote>
<p>
+/- grades may be assigned at the instructors discretion.
</p>
</blockquote>
</div>

<div id="outline-container-org55e56c0" class="outline-3">
<h3 id="org55e56c0"><span class="section-number-3">5.1.</span> An Important Note on Grading</h3>
<div class="outline-text-3" id="text-5-1">
<blockquote>
<p>
There is no special consideration if you need a certain grade in this course to graduate.  <b><b>If you require a certain grade in this class to graduate it is your responsibility to earn that grade.</b></b> Specifically if you receive a `D` in this course I will not allow you to do extra assignments after the course is complete in exchange for a higher grade. 
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgb4b4ce0" class="outline-2">
<h2 id="orgb4b4ce0"><span class="section-number-2">6.</span> Tentative Outline by Week</h2>
<div class="outline-text-2" id="text-6">
<p>
We will cover chapters 1 through 14.  Since this course is asynchronous, you
have a measure of flexibility regarding when you cover each chapter.  The due
dates for the exams/assignments are listed below.
</p>

<p>
<b><b>You will receive a 0 if you do not hand in an exam or assignment by the due date.  Because you have a month to complete the exams/assignments, I will not accept late submissions for any reason.</b></b>
</p>
</div>

<div id="outline-container-org1d04645" class="outline-3">
<h3 id="org1d04645"><span class="section-number-3">6.1.</span> Exam Due Dates</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>June 24: Exam 1 Due</li>
<li>July 24: Exam 2 Due</li>
</ul>
</div>
</div>

<div id="outline-container-org4cc4a4c" class="outline-3">
<h3 id="org4cc4a4c"><span class="section-number-3">6.2.</span> Assignment Due Dates</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>June 24: DEF14A and Debt to Equity Ratio</li>
<li>July 24: Stock Market and CAPM</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga0fa310" class="outline-2">
<h2 id="orga0fa310"><span class="section-number-2">7.</span> How To Ask Questions</h2>
<div class="outline-text-2" id="text-7">
<p>
How to properly phrase a question is important in the workplace as well as in courses, such as ours, where much of the interaction is online.  Remember when formulating your question, <b>you get what you give</b>.  If you simply say, "I don't understand", then I have very little information to work with and so I can't help.  I'll just say to rewatch the relevant video.
</p>

<p>
Alternatively, if you say, "I calculated a stock's expected return using the CAPM and it is negative.  Can this be correct?".  Here you have (1) let me know what you have done, (2) your result, and (3) what you don't understand. In this case I can ask (1) which stock, and (2) is your beta negative, and proceed to explain whether your calculation is correct.
</p>

<p>
<a href="https://stackoverflow.com/help/how-to-ask">See this post.</a>  
</p>
</div>
</div>

<div id="outline-container-org25fa0d3" class="outline-2">
<h2 id="org25fa0d3"><span class="section-number-2">8.</span> Email Communication</h2>
<div class="outline-text-2" id="text-8">
<p>
Questions about course material should be posted to the most relevant discussion board.  Email should only be used for personal matters.  When sending an email, be sure to put the course in the subject line (FIN 302). 
</p>
</div>
</div>

<div id="outline-container-org44f4b7b" class="outline-2">
<h2 id="org44f4b7b"><span class="section-number-2">9.</span> Guidelines and Accommodations</h2>
<div class="outline-text-2" id="text-9">
<p>
Academic Integrity Policy Students Enrolled in this course are required to understand and fully comply with all aspects of the Academic Integrity Policy as described in the SUNY Polytechnic Institute Handbook (available at:  <a href="https://sunypoly.edu/pdf/student_handbook.pdf">https://sunypoly.edu/pdf/student_handbook.pdf</a> )
</p>
</div>

<div id="outline-container-org3bd15dd" class="outline-3">
<h3 id="org3bd15dd"><span class="section-number-3">9.1.</span> Course Syllabus Disclosure Statement Fall 2021</h3>
<div class="outline-text-3" id="text-9-1">
<blockquote>
<p>
Accommodations for Students with Disabilities
</p>

<p>
In compliance with the Americans with Disabilities Act of 1990 and Section 504 of the Rehabilitation Act, SUNY Polytechnic Institute is committed to ensuring comprehensive educational access and accommodations for all registered students seeking access to meet course requirements and fully participate in programs and activities.  Students with documented disabilities or medical conditions are encouraged to request these services by registering with the Office of Disability Services.  Please request accommodations early in the semester, or as soon as you become registered with Disability Services, so that we have adequate time to arrange your approved academic accommodation/s.  Once Disability Services creates your accommodation plan, it is your responsibility to provide me a copy of the accommodation plan.
</p>

<p>
For information related to these services or to schedule an appointment, please contact the Office of Disability Services using the information provided below. 
</p>

<p>
Leslie K. Reid, Director (she/her/hers)
Office of Disability Services 
reidl@sunypoly.edu 
(315) 792-7170 
Utica Campus 
Peter J. Cayan Library, L145 
Albany Campus 
Suite 309, Students Services Office 
NanoFab South 
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew Brigida, Ph.D.</p>
<p class="date">Created: 2022-05-31 Tue 10:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
